holly/app/views/recipes/edit.html.erb

SELECT "ingredients".* FROM "ingredients"  WHERE "ingredients"."recipe_id" = 2
SELECT  1 AS one FROM "ingredients" INNER JOIN "measurements" ON "ingredients"."id" = "measurements"."ingredient_id" WHERE "measurements"."recipe_id" = $1 AND "ingredients"."id" = 1 LIMIT 1  [["recipe_id", 35]]
SELECT "ingredients".* FROM "ingredients" INNER JOIN "measurements" ON "ingredients"."id" = "measurements"."ingredient_id" WHERE "measurements"."recipe_id" = $1  [["recipe_id", 20]]
---
  <br>
  <% Ingredient.all.each do |ingredient| %>
    <%= check_box_tag "recipe[ingredients][]", ingredient.id, (@recipe.ingredients.include? ingredient), id: "ingredient_#{ingredient.id}" %>

SELECT  "measurements".* FROM "measurements"  WHERE "measurements"."recipe_id" = $1 AND "measurements"."ingredient_id" = 1  ORDER BY "measurements"."id" ASC LIMIT 1 OFFSET 1  [["recipe_id", 35]]
---
    <% if @recipe.ingredients.include? ingredient %>
      <input type="text" name="recipe[measurements][]" value=<%="#{@recipe.measurements.where(ingredient_id: ingredient.id).first.quantity}"%>>