holly/app/views/recipes/new.html.erb

SELECT "ingredients".* FROM "ingredients"
---
  <div>
    <% Ingredient.all.each do |ingredient| %>