holly/app/views/recipes/show.html.erb

<br>
<% @recipe.ingredients.each do |f| %>
---
SELECT "ingredients".* FROM "ingredients" INNER JOIN "measurements" ON "ingredients"."id" = "measurements"."ingredient_id" WHERE "measurements"."recipe_id" = $1  [["recipe_id", 17]]