holly/app/views/recipes/show.html.erb

<h4>Ingredients: </h4>
<% @recipe.measurements.each do |m| %>
---
SELECT  "measurements".* FROM "measurements"  WHERE "measurements"."recipe_id" = $1 AND "measurements"."id" = 3  ORDER BY "measurements"."id" ASC LIMIT 1  [["recipe_id", 35]]