holly/app/controllers/home_controller.rb

SELECT  "recipes".* FROM "recipes"  LIMIT 10
---
  def index
    @recipes = Recipe.all.limit(10)