holly/app/controllers/ingredients_controller.rb

    def create
      @ingredient = Ingredient.new(ingredient_params)
      if @ingredient.save
---
INSERT INTO "ingredients" ("created_at", "name", "preparation", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", "2014-11-06 19:47:17.256008"], ["name", "banana"], ["preparation", "mooshed"], ["updated_at", "2014-11-06 19:47:17.256008"]]

    def show
      @ingredient = Ingredient.find(params[:id])
---
SELECT  "ingredients".* FROM "ingredients"  WHERE "ingredients"."id" = $1 LIMIT 1  [["id", 4]]

    def edit
      @ingredient = Ingredient.find(params[:id])
---
SELECT  "ingredients".* FROM "ingredients"  WHERE "ingredients"."id" = $1 LIMIT 1  [["id", 4]]

    def update
      @ingredient = Ingredient.find(params[:id])
      if @ingredient.update(ingredient_params)
---
SELECT  "ingredients".* FROM "ingredients"  WHERE "ingredients"."id" = $1 LIMIT 1  [["id", 4]]
UPDATE "ingredients" SET "name" = $1, "updated_at" = $2 WHERE "ingredients"."id" = 4  [["name", "Chocolates"], ["updated_at", "2014-11-07 22:58:58.070241"]]

    def destroy
      @ingredient = Ingredient.find(params[:id])
      @ingredient.destroy
---
SELECT  "ingredients".* FROM "ingredients"  WHERE "ingredients"."id" = $1 LIMIT 1  [["id", 7]]
DELETE FROM "ingredients" WHERE "ingredients"."id" = $1  [["id", 7]]