holly/app/controllers/recipes_controller.rb

  def create
    @recipe_form = RecipeForm.new(params[:recipe_form])
    @recipe_form.inspect
    if @recipe_form.save
---
INSERT INTO "recipes" ("created_at", "directions", "image", "title", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", "2014-11-06 21:10:44.327039"], ["directions", "Cook 'em!"], ["image", "http://placekitten.com/200/300"], ["title", "Frogs Legs"], ["updated_at", "2014-11-06 21:10:44.327039"]]

  def update
    @recipe = Recipe.find(params[:id])
    if @recipe.update(find_params)
---
SELECT  "recipes".* FROM "recipes"  WHERE "recipes"."id" = $1 LIMIT 1  [["id", 5]]
UPDATE "recipes" SET "directions" = $1, "image" = $2, "title" = $3, "updated_at" = $4 WHERE "recipes"."id" = 35  [["directions", nil], ["image", nil], ["title", nil], ["updated_at", "2014-11-10 04:15:53.604877"]]